app/controllers/users_controller.rb

    def index
        @users = User.all
---
SELECT "users".* FROM "users"

      def show
        # begin
          @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]